[{"yourName":"Luisa Charles","projectName":"Inorganisms","100WordDescription":"Inorganisms is an immersive installation exploring object oriented ontology and the nature of human disruption. It is made up of a series of interactive kinetic sculptures: each sculpture has an output that affects the next sculpture’s behaviour, which creates a chain reaction that builds up, leaving a self-sustaining ecosystem of inorganic organisms living in a state of symbiosis. The sculptures are based on natural traits observed in the animal and plant kingdoms, investigating where the given affordances of everyday objects converge with organic behaviours. This ultimately forms a design fiction, aiming to provide an answer to the question: What if objects evolved to exist in the form that they do, rather than having been designed?","projectType/materials":"Mixed Media Kinetic Sculptures","socialMedia/websiteLinks":"www.luisacharles.com","mapCoOrdinates":"(-70, -60)"},{"yourName":"Harvey Miles","projectName":"Musical Martinis","100WordDescription":"Have a unique drinking experience where music and drink are combined. These cocktails are made by the music they are inspired by with readings from the music determining the ingredients and the flavour creating a new way of listening and drinking.","projectType/materials":"Interactive bar","mapCoOrdinates":"(-55, -90)"},{"yourName":"Cheung Pui Nei","projectName":"Desire","100WordDescription":"Different yet the same\nCollisions and rags passing through the distant Ganges\n\nChaotic soul breaks down and reconstruct \nWhat’s the final puzzle as broken pieces imbody to you and me?\n\nThe installation radiate a cold and latent violence. At times, disconcerting beauty emerges. The inherent visual seductiveness, along with the conciseness of the exhibitions, further complicates the reception of their manifold layers of meaning. By contesting the division between the realm of memory and the realm of experience, absorbed the tradition of remembrance art into daily practice. This personal follow-up and revival of a past tradition is important as an act of meditation.\nHer collected, altered and own works are being confronted as aesthetically resilient, thematically interrelated material for memory and projection. The possible seems true and the truth exists, but it has many faces, as Hanna Arendt cites from Franz Kafka.","mapCoOrdinates":"(-80, -80)"},{"yourName":"Guillaume Querard","projectName":"BLOW by BLOW","100WordDescription":"BLOW by BLOW is a participative and collaborative installation.\nThrough this installation I want the audience to think about a collective effort and experience in a physics and visual way the fact that when people come together greatness can be achieved. As an individual, you may feel powerless and like an act of a single\nperson won’t make a difference. This project shows people in a literal way is that when enough of such individuals come together and are bound by a common belief that is where true power lies.\nThis project is a metaphor of a collective effort to achieve something big.","projectType/materials":"Interactive installation using wind sensors and fans\n","mapCoOrdinates":"(-30, -90)"},{"yourName":"Ka Kwan Ng","projectName":"The Hourglass","100WordDescription":"In the U.K. we use 7 million disposable paper cups everyday, that is 5 paper cups every minute. HOURGLASS is a time capsule that drops 5 wooden beads every minute, onto a reusable Keep Cup. The goal is to demonstrate the unsustainable living, and the mass consumption of paper cups we undergo every day. HOURGLASS also allow us to perceive TIME, we see how many minutes have passed by counting how many paper cups have been wasted.","projectType/materials":"Mixed Media Physical Computing Piece","socialMedia/websiteLinks":"www.ngkakwan.com","mapCoOrdinates":"(-22, -100)"},{"yourName":"Naina Thada Magar","projectName":"The Official English Dictionary","100WordDescription":"The English Language has adopted a lot of words from many different countries over the centuries. These types of words are described as “loanwords”. The term ‘loan’ implies that the item that was ‘loaned’ has to be given back eventually. But what would the English Language look like if every single loanword were sent back to their country of origin? In this dictionary, every single loanword in the english language has been erased. Only words originating from Old English is kept, hence the making this dictionary the ‘Official’ English Dictionary.","projectType/materials":"Information Design\nBook Design\nArtefact","socialMedia/websiteLinks":"https://nainasaram.wixsite.com/portfolio","mapCoOrdinates":"(-17, -83)"},{"yourName":"Yae Jin Hong","projectName":"Bloom","100WordDescription":"On Parents' day (8th), parents are presented red carnations; which carry a meaning of wishing good health. Inspired by \"Wildflower 1\" by poet Tae Joo Na, this interactive piece portrays one's constant changing perspective of one’s parents. Perhaps it is the wisdom we obtain whilst growing up, or the disputes we encounter in relationships – some boundaries start becoming visible, previous ones disappear.\n","projectType/materials":"Physical Computing Mixed Media Interactive Installation","socialMedia/websiteLinks":"www.yaejinhong.wixsite.com/mysite","mapCoOrdinates":"(33, -77)"},{"yourName":"Lou-Anne Le Mener","projectName":"Womb - From Denver to Paris","100WordDescription":"Womb was a way for me to speak about my adoption story through art. \nWomb is a doll’s house using shadow puppetry. Every window represents a moment of my life. From the giving of the baby to the new mother to be, to identity questioning when growing up, to a 21-year-old who found her birth parents. The imagery was inspired by Kara Walker.  Womb is a magical and emotional piece to retrace a moment and a story.","projectType/materials":"Light-driven Acrylic Sculpture","mapCoOrdinates":"(76, -100)"},{"yourName":"Lisa Melkumov","projectName":"Memory of a Dear Place, Ballerinas & Boxers","100WordDescription":"(Memories of a dear place:) Gayane Pogosova plays her very first concert, Memories of a dear place, to the last video recording that has been kept from her family living in Azerbaijan and trips to Armenia during the 60´s. In 1985, Gayane Pogosova and Osip Melkumov moved to Moscow for work, but two years later the borders of Azerbaijan, their native land became closed for them. Now from Palma de Mallorca, Spain, she narrates her memories about her hometown, Baku. (Ballerinas and boxers:) A photographic essay exploring the outward contrast between two seemingly polarised disciplines, while finding fundamental similarities in the strength, dedication and sacrifice made by individuals.","projectType/materials":"Ballerinas and boxers: Digital Photography--- Memories of a Dear place: Digital and analogue film ","socialMedia/websiteLinks":"@lisamelkumovphotography www.lisamelkumov.wix.com/photoandesign","mapCoOrdinates":"(53, -48)"},{"yourName":"Florence Zhou","projectName":"Thursday","100WordDescription":"Thursday is the busiest day on dating platforms every week, my project is a set of physical interactive objects that allow audience to play with, two handmade ceramic pieces each represents one fictional character who is active on dating apps. Audience can freely play with them just like interacting with strangers online, and also a blushing effect as response can be triggered when audience took specific actions that makes them ‘happy’. ","unlimitedDescription":"Each ceramics were given different personalities , when audience first meet them, they have no idea of how to act to make a exciting interaction. Several hint will be given as affordance to encourage audience to explore more into the relationship with those two 'strangers/.","projectType/materials":"Physical Computing Piece with Hand-made Ceramics","socialMedia/websiteLinks":"na","mapCoOrdinates":"(13, -26)"},{"yourName":"Jiyoon Kim","projectName":"The Truth","100WordDescription":"During World War II, Korea was occupied by the imperial Japanese Army. Japanese Army forced Korean women and young girls into sexual slavery. However, Japan has denied and not apologies for the fact. As a Korean, my project represents the truth that from the victims by testimony. ","projectType/materials":"Wooden Spin Puzzle","socialMedia/websiteLinks":"www.behance.net/jiiyyyoonn","mapCoOrdinates":"(-13, -14)"},{"yourName":"Luisa Charles & Miryana Ivanova","projectName":"Simulating a Degree","100WordDescription":"The Sims is a life simulation sand box type game, which lacks any defined goals. It lets its players build homes, mould characters from scratch and control their lives in a virtual world. \nIn this gameplay of the Sims, you are given the power of controlling each one of the 27 characters who resemble the likeness and interests of the 27 students who are presenting their projects right here, right now. ","projectType/materials":"Game Based Simulation","mapCoOrdinates":"(-20, 22)"},{"yourName":"Miryana Ivanova","projectName":"DATA","100WordDescription":"The internet has become an inseparable part of our lifestyle. We connect, we observe, we upload and we search. This project looks at how much data we produce and who collects it, as well as what that data could be used for. \nOne book that contains seven months of Google search history amassing to 1311 pages: the approximate 7866 searches of one individual. What would your search history look like if you printed it?\nThree portraits which reveal more information than they hide. \nHow could data be used to potentially classify people and affect their lives. One important question: Are we ready yet? ","projectType/materials":"Book and augmented reality portraits","mapCoOrdinates":"(29, 29)"},{"yourName":"Jason Ekonomou","projectName":"Yo-yos","100WordDescription":"This installation is aiming to visualise a yoyo's movement in a playful and physical way. Releasing the yoyo will cause it to leave a trail of paint on the paper that is enclosed in the installation, illustrating its movement in an abstract, yet informative way. The piece supported by the display of two other painting attempts, outside the installation, throwing the yoyos by hand, as well as the very interesting aftermath of the paint on the yoyo itself in the form of photographs. ","projectType/materials":"wooden installation","mapCoOrdinates":"(40, 54)"},{"yourName":"Vanya Cantone","projectName":" t1⁄2","100WordDescription":" t1⁄2 is centred on the notion of meaning as a perceptual construct. Using language as a medium,  t1⁄2 addresses psychoacoustics through challenging the phonological meaning, and understanding of linguistics through semantic saturation. t1⁄2 takes the form of an interactive installation, where participants are given the chance to provide an auditory input, which will then be replayed and stored in a loop. Each new input pushes all previous recordings one position down creating an archive of sounds. Generating a gradual, ever growing assembly of reverberations over time.\n","projectType/materials":"Interactive sound installation","mapCoOrdinates":"(47, 21)"},{"yourName":"Lisa Melkumov & Lou-Anne Le Mener","projectName":"Beyond Plastic","100WordDescription":"The photographic essay ‘Beyond Plastic’ highlights the increasing market of love dolls and their verisimilitude to humans. By documenting the life of a lovedoll, this piece explores the degrees of intimacy and imagination that can be achieved with such uncanny objects.","projectType/materials":"Photo Book & Digital photography","socialMedia/websiteLinks":"\n@lisamelkumovphotography www.lisamelkumov.wix.com/photoandesign\n","mapCoOrdinates":"(64, 13)"},{"yourName":"Abdullah Habib, Ewa Winiarczyk, Vanya Cantone","projectName":"Vertical","100WordDescription":"More than £3bn is being invested in the regeneration of Elephant and Castle. This has met with multiple protests, in response to a number of issues, such as the scarcity of affordable social housing proposed. This project deploys ethnographic methods to give voice to the individuals born, raised and working around the shopping centre. It alludes to the verticality of architectural changes and collective memories connected to the site-specific locations. Vertical takes the form of a film, and is accompanied by sculptures moulded from fragments of the soon-to-be-demolished buildings that surround the shopping centre. Vertical was made with the great help of local participants.\n","projectType/materials":"Screen-based Installation","mapCoOrdinates":"(90, 50)"},{"yourName":"Lucio Martus Alonso","projectName":"Out of Pocket","100WordDescription":"One of the biggest challenges as a student in London is facing how to finance and live in the big city. In this installation I aim to showcase the data I have been recording for the last three years of my degree. With this, visitors are invited to explore my experience and my adaptation into independance in an interactive and visual experience. Each piece represents a payment made, which all together create a visual scale of where the money went. And with each graph showing different aspects of consumption, people will be able to see where  the money went and how I spent it.","projectType/materials":"Laser Cut MDF","socialMedia/websiteLinks":"https://www.behance.net/lumartus950a3f, Instagram/Twitter: @luciomartus","mapCoOrdinates":"(100, 67)"},{"yourName":"Ashmi Mridul","projectName":"The Camera Obscura Connection","100WordDescription":"A translocal community art project in which participants from several cities of the world were connected by the shared experience of constructing a camera obscura on the same day. Camera obscuras are room-sized pinhole cameras, created by completely blacking out a room, leaving just a small hole for light to seep in and create an image on the walls. The viewers are surrounded by a spectacular visual which brings the outside inside. The project came out of my personal desire to share this experience with friends and family around the world. I sent out kits with materials and instructions for them to construct their own cameras. Inside this box, are images of different locations, captured in varied confined spaces by all the community members. Peep in, to get a glimpse of the world from their eyes! ","projectType/materials":"Installation with light projections","mapCoOrdinates":"(95, 95)"},{"yourName":"Clovis Bataille","projectName":"The Door of Perception","100WordDescription":"What is shown inside of the space is an Alphabet. Of things that I notice in my close surroundings. It is a language, a vocabulary specific to me, but characters that are also readable by all. Since we are from London College of Communication I felt the need for people, everyone, to understand the work, not only the ones interested in Art. There are different layers of interpretation to this work. It is showing a side of our surroundings that I consider real. Real in the sense of proofs of our living. The damages caused by our evolution in a given environment. With this body of work, a pretty much urban one. The entrance to the space is through a door in the shape of a scar located on my belly. This work comes from an exploration of my identity, where I locate myself in this world, what I make out of it and why I make it.","projectType/materials":"Immersive Installation including Ink on Paper works.","socialMedia/websiteLinks":"Instagram : @clovisbataille","mapCoOrdinates":"(70, 100)"},{"yourName":"Tianyi Liu","projectName":"a Garden beyond four quartets","100WordDescription":"Following on a journey with me to walk through this garden bridging among real, fictional and spiritual world. I try to cultivate my own garden based on metaphor of garden, and situating between essence and phenomenon of it with found memories, real life experience, literary and myth. This is a study of garden related to human condition by visiting mine and other people’s experience and memories in different time and space. It's a jouney of learning a way of being and seeing things under the image again, and walking out from garden of Eden to garden of real life in this era. The garden triggers me to start this journey, while it also greets me, and derives more from me. Slowing down you pace and give the space a time to echo, repercussion, and mirror your mind here.","projectType/materials":"Immersive Installation landscape with transformed found objects sculpture, reading archives, walking and mapping experience  ","socialMedia/websiteLinks":"instagram: chipsandyogurt                 http://cargocollective.com/chipsandyogurt","mapCoOrdinates":"(-23, 70)"},{"yourName":"J Whitehead","projectName":"Don't Tell Me How to Feel About You, 100 Days, Sticks and Stones","100WordDescription":"Don't Tell Me How to Feel About You - Don't Tell Me How To Feel About You is a personal piece which I created in order to give me the opportunity to say things that I never got the chance to say to past lovers who wronged me. I created the 'boyfriend' as a kind of vessel for my rage and worked from there, taking him out in public, on dates, taking photographs and experiencing intimacy with this inanimate object. I wanted the opportunity to get things off my chest as well as giving myself a safe space to experience intimacy and companionship without opening myself up to cruel remarks and actions from real people. This piece evolved into a film in three chapters featuring poetry written by myself about three of the most scarring interactions with lovers., 100 Days - For this project I took a self portrait every day for 100 days to explore my self identity. I uploaded these to Instagram (@s_cattered) in order to collate them. This gradually evolved into a piece about my emotions toward myself. I created two books, the first accompanies 100 photos with my opinions of myself whilst the second contrasts this with the opinions of a loved one who puts me on a pedestal., Sticks and Stones - This project aims to put a spotlight on misogyny and sexism. I asked women to write on a post it note some of the most hurtful things men had said to them as a cathartic process then stick it on a wall in order to highlight the magnitude of this issue. I hope to use this project to show women that they are not alone and in solidarity with the #metoo movement fighting  against rape culture.","unlimitedDescription":"Sticks & Stones\n\nA Performative Installation / Photographic Prints\n\nThis piece aims to put a spotlight on misogyny and sexism. It began as a therapeutic exercise between my flatmates and I two years ago. We would often experience sexist remarks and behaviour on nights out, on the street and even in our homes. This started to become the main focus of our thoughts and conversation so we needed a way to get it off our chests. We began writing these remarks and actions on sticky notes and putting them on the wall, affectionately naming it ‘the man shame wall’. The cathartic release we felt from this simple exercise was incredible and very quickly we had a physical representation of the scale of the problem. Having left the flat, I had searched for ways to stop myself from dwelling on the emotions attached to such mistreatment from men. This led me to return to the wall, wondering if others had felt similar emotions and how I could open it up to a wider audience and give that sense of relief to more women with similar experiences whilst simultaneously highlighting the scale of the issue. \nIn response to this, I sent out an open call for women who felt they had things to get off their chests. Although they were wary, I found that many of the women were very keen to open up to me in this way. I took photographs with the women holding their sticky notes, some even requested to write more than one. Understandingly many of the women were concerned about anonymity so we worked together to take photographs with a level of anonymity that they were comfortable with. The outcome of this piece became a wall of sticky notes, highlighting the shocking nature of the way these women had been treated and multiple photographic prints of the women holding their sticky notes. \nI am hoping to take this project further, by opening it up to a much wider audience. I am hoping to provide an opportunity for women to have a cathartic release whilst also creating a much larger wall that is more representative of the scale and severity of sexism in 2018, potentially working alongside the #metoo movement, fighting against rape culture. \n\nDon’t Tell Me How To Feel About You\n\nFilm/ Fabric Dummy\n\n‘Don’t Tell Me How To Feel About You’ is a personal piece I created that was born out of the feelings I had toward past lovers who had wronged me. I created this piece in order to give myself the opportunity to say the things that I have felt in response to these men that I never got to say at the time. I created the ‘Boyfriend’ as a vessel for my rage and distress and progressed from that point. Allowing him to embody the different lovers through clothing and the way I interacted with him. I took him out in public on dates in order to see how the public would react to us but also to simulate companionship that was cut short. I wanted the opportunity to get things off my chest as well as giving myself a safe space to experience intimacy and companionship without opening myself up to cruel remarks and actions from real people. The piece evolved into a film in three chapters following some organic, spontaneous writing of spoken word pieces about three of the most hurtful lovers. I wanted to portray in film the outcomes of the relationships that I had wished for in contrast to the stories of hurt, betrayal and manipulation. I hope to continue these experiments in self-care and recovery in the future which will culminate in a public display of rage to allow me to process the anger I have been feeling for some time and have not yet dealt with. \n\n100 Days\n\nSelf Portraiture / Printed Books\n\nIn response to a short film I made exploring my identity and feelings toward my body (“10 second portraits of 6 different people”) I began documenting my face/body by taking one self-portrait a day and uploading it to Instagram (@S_cattered) in order to collate them. As I moved through the project I decided to set myself a time scale of 100 days since this would be enough time to notice changes in myself. Once I had a collection of 100 self-portraits, I decided that I wanted to make a photobook, showing the photos in chronological order with the hope to demonstrate change. \nWhen it came to adding text to these books I wanted to create something that would show how I felt about my body since my self-esteem was at an all-time low. I found myself self-depreciating in all of the text that accompanied the photographs but I let myself pour my feelings onto the page regardless, finding it strangely therapeutic. To accompany this, I wanted to contrast my own emotions with someone else’s so I selected a loved one who puts me on a pedestal to make their own comments on the photographs, creating a stark contrast between my own self-depreciative opinions and his hyper-positive opinions of me. It was incredibly interesting for me to explore who I am and want to be whilst really delving into the idea that beauty is indeed in the eye of the beholder. \n\n\nMuseum of lost childhood\n\nInteractive installation / Process Film\n\nThe Museum of Lost Childhood was a piece I created in response to my emotions toward my body failing me. As a child, I was diagnosed with Acute Lymphoblastic Leukaemia, the treatment for which took a toll on my body and mental health. As an adult, I am still coming to terms with what happened to me as well as dealing with the late effects of the treatment I went through. I wanted to create a performative piece about what I went through and the feelings I am still going through so collated objects and paperwork from my time in hospital and relating to my more recent diagnoses in order to create a space that demonstrated that difficult period in my life and would give the viewer a similar sense of overwhelm that I have been feeling. I wanted to make this piece interactive and accessible to others so focused on the theme of loss in response to my lost childhood, lost hair and lost time. \n        I took a quote from Malcom X which states “every loss contains its own seed” and decided to create my own paper containing seeds for plants that represent hope, new life and companionship. I then asked people to come and experience the space and write about their own losses on this seeded paper, trading their loss for a small vial of the hair that I lost from my first round of chemotherapy that I had kept. It was extremely emotional for everyone involved but it made for a therapeutic experience, many of the participants wishing to share extremely personal and even traumatic stories of loss with me, a total stranger. \n","projectType/materials":"Don't Tell Me How to Feel About You - Textile & Polyester Stuffing, 100 Days - Photo Books, Sticks and Stones - Photographic Prints","mapCoOrdinates":"(-20, 50)"},{"yourName":"Yi Tian","projectName":"Yet Everything Happens Only a Certain Number of Times","100WordDescription":"Yet Everything Happens Only A Certain Number Of Times is an hourglass made of two glasses that joined with mild steel in the middle. The water inside represents the running time. The more the hourglass gets rotated, the rustier the mild steel will be and more turbid the water will be. Eventually, the whole piece will be broken.\nThe name of the project comes from the music Fullmoon, which is composed by Japanese artist Ryuichi Skamoto, and responds to the quotes from The Tibetan Book Of Living And Dying.","projectType/materials":"Glass and Steel","mapCoOrdinates":"(77, 77)"},{"yourName":"Nicoleta Faina","projectName":"Bondage Cape, Klofno Books","100WordDescription":"Bondage Cape - Painted with nature on significant summer pagan celebrations, the ritual clothing explores the bond between mankind and nature.  Klofno Books - Aboriginal tales told without words. Three interactive wooden books continue the pattern through which stories were passed down the generations, but through a new channel: using haptic, visual and interactive elements, the reader takes on their own interpretation of these myths.","projectType/materials":"Bondage Cape - Interactive ; UV Studio and Nature Photography + Clothing Piece exhibited in a frame structure. Klofno books - Experimental/multimedia ; Birch wood, Interactive Pieces, Sound and Light System, Paint. ","socialMedia/websiteLinks":"https://nicoletafaina.wixsite.com/portfolio","mapCoOrdinates":"(-85, 72)"},{"yourName":"Ewa Winiarczyk","projectName":"Our Lady of Air Pollution","100WordDescription":"Poland is the most religious country in the EU - and during winter also the most polluted one. The air pollution in small towns is not caused by industrialisation, but rather human activity: burning household trash, which ranges from rubber to plastic. This project tackles the issue in a site-specific way, focusing on an off-season spa town Busko-Zdrój, which reaches deadly pollution levels every year. It aims to temporarily shift the power of religion - from being connected with constant human rights violation (especially in the context of rigorous abortion laws) to a social change catalyst. The process involves a letter sent to Pope Francis, smog detecting religious artefacts and local participation, among others.","projectType/materials":"audio installation (with headphones)","mapCoOrdinates":"(-20, 75)"},{"yourName":"THIS SECTION MUST BE FILLED IN BY EVERYONE","mapCoOrdinates":"THIS SECTION IS FOR LUISA ONLY"}]